krapyv/stm32-i2c-driver/i2c.c
#include <stdint.h>
#include <stdio.h>
#include "i2c.h"
#include "stm32f411.h"
#include "core_cm4.h"

void I2C_Reinit(void)
{
    // explicitly disable PE (bit 0 CR1) to prevet undefined hardware behavior
    // if the PE is already 1 after reboot or SWRST recovery
    hi2c.Instance->CR1 &= ~(1 << 0);

    // set the bit 15 to 0 (Sm mode I2C)
    hi2c.Instance->CCR &= ~(1 << 15);

    // set the CCR [11:0] to 80 = 0x50, since CCR = T_high / T_pclk1
    // where T_high = 5000 ns, T_pclk1 = 62.5 ns (1 / 16 000 000)

    // clear the range 11:0
    // 111111111111 = 0xFF
    hi2c.Instance->CCR &= ~(0xFFF << 0);

    // set the range to 0x50
    hi2c.Instance->CCR |= (0x50 << 0);

    // set FREQ[5:0] (Peripheral clock frequency) in CR2
    // clear the bits
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 48 + 15 = 63 = 0x3F
    hi2c.Instance->CR2 &= ~(0x3F << 0);

    // set the bits
    // 16 MHz = 010000 = 0x10
    hi2c.Instance->CR2 |= (0x10 << 0);

    /* ----- Interrupts enablement (CR2) -----*/

    // set ITERREN (Error interrupt enable) Bit 8 to 1
    hi2c.Instance->CR2 |= (1 << 8);

    // set ITEVTEN (Event interrupt enable) Bit 9 to 1
    hi2c.Instance->CR2 |= (1 << 9);

    // set ITERREN (Buffer interrupt enable) Bit 10 to 1
    hi2c.Instance->CR2 |= (1 << 10);

    /* ----- TRISE configuration ----- */
    // set the bits 5:0 to 17 = 0x11
    // 1000 ns / 62.5 + 1 = 16 + 1 = 17

    // clear the range
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 40 + 20 + 3 = 63 = 0x3F
    hi2c.Instance->TRISE &= ~(0x3F << 0);

    // set the range to 0x11
    hi2c.Instance->TRISE |= (0x11 << 0);

    // ----- CR1 configuration ----- //

    // set bit 0 PE (Peripheral enabled) to 1

    hi2c.Instance->CR1 |= (1 << 0);

    // set bit 10 ACK (Acknowledge enable) to 1
    // since this bit is set and cleared by software and cleared by hardware when PE = 0
    // it is enabled after PE became 1
    hi2c.Instance->CR1 |= (1 << 10);
}

// Events Interrupt Handler (priority 38 - cannot be preempted by I2C1_ER)
void I2C1_EV_IRQHandler(void)
{
    // if the state is ERROR, return
    if (hi2c.state == I2C_STATE_ERROR)
    {
        return;
    }

    // make snapshot of current state of SR2
    switch (hi2c.mode)
    {
    case I2C_TX:
        break;

    case I2C_RX:
        break;

    case I2C_TX_RX:
        break;

    default:
        break;
    }

    return;
}

// Error Interrupts Handler (priority 39 - can be preempted by I2C1_EV)
void I2C1_ER_IRQHandler(void)
{
    // disable interrupts
    __disable_irq();

    // populate the error_code

    // make snapshot of current state of SR1
    uint16_t sr1_snap = hi2c.Instance->SR1;

    // isolate the errors bits 11:8 and assigning to the error_code
    // 0b00001111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
    hi2c.error_code = (sr1_snap & ((uint16_t)0xF << 8));

    // error code checking branches
    if (hi2c.error_code & I2C_ERROR_BERR)
    {
        // needs SWRST hard reset

        // since I immediately enable SWRST, there is no explicit SR1 error flag clearing
        // the SR1 flags cleared immediately by SWRST

        // set SWRST to 1
        hi2c.Instance->CR1 |= (1 << 15);

        // clear the pending EV interrupt
        // I2C1_EV has a position of 31
        // one ICPR has 32 Interrupt-related bits (0...31)

        // with NVIC the write-1-to-clear is the tool that allows to prevent race conditions if another interrupt fires mid-execution
        NVIC->ICPR[0] = (1 << 31);
    }
    else if (hi2c.error_code & I2C_ERROR_ARLO)
    {
        // needs to wait until the current transmission is over because the another master seized the bus

        // clear the SR1 ARLO error flag
        hi2c.Instance->SR1 &= ~(1 << 9);

        // no stop issuing since the microcontroller is no longer a master
    }
    else if (hi2c.error_code & I2C_ERROR_AF)
    {
        // needs to issue STOP and then try the communication again

        // make snapshot of current CR1
        uint16_t cr1_snap = hi2c.Instance->CR1;

        // clear the SR1 AF error flag
        hi2c.Instance->SR1 &= ~(1 << 10);

        // issue STOP condition

        uint32_t cr1_modified = cr1_snap;

        // set the STOP bit to 1
        cr1_modified |= (1 << 9);
        // set the ACK bit to 1
        cr1_modified |= (1 << 10);
        // clear the POS bit
        cr1_modified &= ~(1 << 11);

        // direct write of the modified CR1 to I2C->CR1
        hi2c.Instance->CR1 = cr1_modified;
    }

    // set the state to ERROR
    hi2c.state = I2C_STATE_ERROR;

    // enable interrupts
    __enable_irq();

    return;
}

static uint8_t I2C_Validate_Pins(I2C_HandleTypeDef *hi2c)
{
    if (hi2c->channel == I2C_CHANNEL_1)
    {
        if (hi2c->scl_port == GPIOB && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 6 || hi2c->scl_pin == 8) && (hi2c->sda_pin == 7 || hi2c->sda_pin == 9))
            {
                return 1;
            }
        }
    }
    else if (hi2c->channel == I2C_CHANNEL_2)
    {
        if (hi2c->scl_port == GPIOB && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 10) && (hi2c->sda_pin == 3 || hi2c->sda_pin == 9))
            {
                return 1;
            }
        }
    }
    else if (hi2c->channel == I2C_CHANNEL_3)
    {
        if (hi2c->scl_port == GPIOA && hi2c->sda_port == GPIOB)
        {
            if ((hi2c->scl_pin == 8) && (hi2c->sda_pin == 4 || hi2c->sda_pin == 8))
            {
                return 1;
            }
        }
    }

    return 0;
}

// TODO: timeout mechanism via hi2c->get_tick_ms function pointer
// curretly spins indefinitely if hardware becomes unresponsive
// must be implemented before production use

void I2C_Init(I2C_HandleTypeDef *hi2c)
{
    if ((hi2c->channel >= I2C_CHANNEL_MAX) || !I2C_Validate_Pins(hi2c))
    {
        return;
    }

    /* ----- I2C Choosing ----- */
    if (hi2c->channel == 1)
    {
        hi2c->Instance = I2C1;
    }
    else if (hi2c->channel == 2)
    {
        hi2c->Instance = I2C2;
    }
    else
    {
        hi2c->Instance = I2C3;
    }
    /* ----- I2C Choosing ----- */

    switch (hi2c->channel)
    {
    case I2C_CHANNEL_1:
        // enable GPIOB clock
        RCC->AHB1ENR |= (1 << 1);

        // enable I2C for channel 1
        RCC->APB1ENR |= (1 << 21);

        break;
    case I2C_CHANNEL_2:
        // enable GPIOB clock
        RCC->AHB1ENR |= (1 << 1);

        // enable I2C for channel 2
        RCC->APB1ENR |= (1 << 22);

        break;
    case I2C_CHANNEL_3:
        // enable GPIOA and GPIOB clocks
        RCC->AHB1ENR |= (1 << 1) | (1 << 0);

        // enable I2C for channel 3
        RCC->APB1ENR |= (1 << 23);

        break;
    default:
        return;
    }

    /* ----- set the MODER for SCL pin and SDA pin to Alternate function ----- */
    // value: 10

    // one pin takes 2 bits, so (2 * pin_number):
    // e.g. pin 6 takes 2*6 = 12 => 13:12
    // pin 7 takes 2*7 = 14 => 15:14
    // pin 0 takes 2*0 = 0 => 1:0

    // clear the MODER bits
    // 11 = 0x3
    hi2c->scl_port->MODER &= ~(0x3 << (2 * hi2c->scl_pin));
    hi2c->sda_port->MODER &= ~(0x3 << (2 * hi2c->sda_pin));

    // set the MODER bits
    // 10 = 0x2
    hi2c->scl_port->MODER |= (0x2 << (2 * hi2c->scl_pin));
    hi2c->sda_port->MODER |= (0x2 << (2 * hi2c->sda_pin));

