krapyv/stm32-i2c-driver/i2c.c
    /* ----- set the AFRL for SCL pin and SDA pin to AF4 ----- */
    // AF4 value: 0100

    // AFRL/AFRH uses 4 bits per 1 pin

    if (hi2c->scl_pin >= 8)
    {
        // pins 8-15 are set in AFRH

        // clear the AFRH bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c->scl_port->AFRH &= ~(0xF << (4 * (hi2c->scl_pin - 8))); // scl_pin - 8 to prevent overflow of 32 bit register

        // set the bits to AF4
        hi2c->scl_port->AFRH |= (GPIO_AF4 << (4 * (hi2c->scl_pin - 8)));
    }
    else
    {
        // pins 0-7 are set in AFRL

        // clear the AFRL bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c->scl_port->AFRL &= ~(0xF << (4 * hi2c->scl_pin));

        // set the bits to AF4
        hi2c->scl_port->AFRL |= (GPIO_AF4 << (4 * hi2c->scl_pin));
    }

    if (hi2c->sda_pin >= 8)
    {
        // pins 8-15 are set in AFRH

        // clear the AFRH bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c->sda_port->AFRH &= ~(0xF << (4 * (hi2c->sda_pin - 8))); // sda_pin - 8 to prevent overflow of 32 bit register

        // set the bits to AF4
        hi2c->sda_port->AFRH |= (GPIO_AF4 << (4 * (hi2c->sda_pin - 8)));
    }
    else
    {
        // pins 0-7 are set in AFRL

        // clear the AFRL bits
        // 1111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
        hi2c->sda_port->AFRL &= ~(0xF << (4 * hi2c->sda_pin));

        // set the bits to AF4
        hi2c->sda_port->AFRL |= (GPIO_AF4 << (4 * hi2c->sda_pin));
    }

    /* ----- set the OTYPER for SCL pin and SDA pin to Open-drain ----- */
    // value 1

    hi2c->scl_port->OTYPER |= (1 << hi2c->scl_pin);
    hi2c->sda_port->OTYPER |= (1 << hi2c->sda_pin);

    /* ----- explicitly clear the PUPDR for SCL and SDA pins ----- */
    // since PUPDR give 2 bits per pin, we are using (2 * SCL pin number), (2 * SDA pin number)

    // 11 = 0x3
    hi2c->scl_port->PUPDR &= ~(0x3 << (2 * hi2c->scl_pin));
    hi2c->sda_port->PUPDR &= ~(0x3 << (2 * hi2c->sda_pin));

    /* ----- I2C CCR configuration ----- */

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // explicitly disable PE (bit 0 CR1) to prevet undefined hardware behavior
    // if the PE is already 1 after reboot or SWRST recovery
    I2C->CR1 &= ~(1 << 0);

    // set the bit 15 to 0 (Sm mode I2C)
    I2C->CCR &= ~(1 << 15);

    // set the CCR [11:0] to 80 = 0x50, since CCR = T_high / T_pclk1
    // where T_high = 5000 ns, T_pclk1 = 62.5 ns (1 / 16 000 000)

    // clear the range 11:0
    // 111111111111 = 0xFF
    I2C->CCR &= ~(0xFFF << 0);

    // set the range to 0x50
    I2C->CCR |= (0x50 << 0);

    // set FREQ[5:0] (Peripheral clock frequency) in CR2
    // clear the bits
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 48 + 15 = 63 = 0x3F
    I2C->CR2 &= ~(0x3F << 0);

    // set the bits
    // 16 MHz = 010000 = 0x10
    I2C->CR2 |= (0x10 << 0);

    /* ----- Interrupts enablement (CR2) -----*/

    // set ITERREN (Error interrupt enable) Bit 8 to 1
    I2C->CR2 |= (1 << 8);

    // set ITEVTEN (Event interrupt enable) Bit 9 to 1
    I2C->CR2 |= (1 << 9);

    // set ITERREN (Buffer interrupt enable) Bit 10 to 1
    I2C->CR2 |= (1 << 10);

    /* ----- TRISE configuration ----- */
    // set the bits 5:0 to 17 = 0x11
    // 1000 ns / 62.5 + 1 = 16 + 1 = 17

    // clear the range
    // 111111 = 2^5 + 2^4 + 2^3 + 2^2 + 2^1 + 2^0 = 32 + 16 + 8 + 4 + 2 + 1 = 40 + 20 + 3 = 63 = 0x3F
    I2C->TRISE &= ~(0x3F << 0);

    // set the range to 0x11
    I2C->TRISE |= (0x11 << 0);

    // ----- CR1 configuration ----- //

    // set bit 0 PE (Peripheral enabled) to 1

    I2C->CR1 |= (1 << 0);

    // set bit 10 ACK (Acknowledge enable) to 1
    // since this bit is set and cleared by software and cleared by hardware when PE = 0
    // it is enabled after PE became 1
    I2C->CR1 |= (1 << 10);
}

static uint8_t I2C_PollHardwareFlags(I2C_RegDef_t *I2C, I2C_Bit_Masks_t bit_mask)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8)))
        {
            uint32_t cr1_snap = I2C->CR1;

            sr1_snap &= ~((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8));

            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 = sr1_snap;

            uint32_t cr1_modified = cr1_snap;

            // set the STOP bit to 1
            cr1_modified |= (1 << 9);
            // set the ACK bit to 1
            cr1_modified |= (1 << 10);
            // clear the POS bit
            cr1_modified &= ~(1 << 11);

            // direct write of the modified CR1 to I2C->CR1
            I2C->CR1 = cr1_modified;

            return 1;
        }

        // secondly, check the bit
        if (sr1_snap & bit_mask)
        {
            // if the bit is set, exit the loop
            return 0;
        }
    }
}

uint8_t I2C_PollHardwareBusy(I2C_RegDef_t *I2C)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;
        uint32_t sr2_snap = I2C->SR2;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 10) | (1 << 9) | (1 << 8)))
        {
            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 &= ~((1 << 10) | (1 << 9) | (1 << 8));

            // generate STOP condition to gracefuly and safely release the lines
            I2C->CR1 |= (1 << 9);

            return 1;
        }

        if (!(sr2_snap & (1 << 1)))
        {
            // if the BUSY bit is 0, exit the loop
            return 0;
        }
    }
}

I2C_Status_t I2C_Master_Transmit(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c == NULL || hi2c->Instance == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(I2C))
    {
        return I2C_ERROR;
    }

    // start the transaction by issuing START (set to 1)
    I2C->CR1 |= (1 << 8);
    // START is cleared by hardware when start is sent

    // polling the SB (Start bit)
    // when exit, the bit is set, start condition generated
    if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
    {
        return I2C_ERROR;
    }

    // SB is cleared by reading SR1 (done in the poll above) + writing DR
    // SR1 read is already consumed by the polling loop - writing DR now completes the clear

    // write the slave address to the DR register (it will start sending the bits to the slave and clear the SB bit)
    // 7 bit slave address + W (Write) bit 0
    I2C->DR = (slave_addr << 1) & ~0x01; // 0x01 = 2^0 = 1 = (1 << 0)

    // polling the ADDR (Address sent) bit
    // the bit is set after the ACK of the byte
    if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
    {
        return I2C_ERROR;
    }

    // read the SR1 and SR2 to clear the ADDR bit in the SR1
    // SR1 read is already consumed by the polling loop above - reading SR2 now completes the clear
    uint32_t dummy = I2C->SR2;
    (void)dummy; // preventing the compiler warnings of an unused variable

    // ensure we are the Master (MSL, bit 0 = 1) and Transmitter (TRA, bit 2 = 1)
    // 0b0101 = 2^2 + 2^0 = 4 + 1 = 5 = 0x05
    if ((dummy & ((1 << 2) | (1 << 0))) != 0x05)
    {
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 |= (1 << 9);
        return I2C_ERROR;
    }

