krapyv/stm32-i2c-driver/i2c.c
    for (uint8_t i = 0; i < length; i++)
    {
        // polling the TxE Transmitters Data register empty
        // goes high after every byte leaves the DR
        if (I2C_PollHardwareFlags(I2C, I2C_TXE_MASK))
        {
            return I2C_ERROR;
        }

        I2C->DR = data[i];
    }

    // before sending the STOP condition
    // we need to make sure the byte has left the shift register, so we are not going to corrupt the last byte mid-sending
    // polling the Byte transfer finished
    if (I2C_PollHardwareFlags(I2C, I2C_BTF_MASK))
    {
        return I2C_ERROR;
    }

    // issuing the Stop generation
    I2C->CR1 |= (1 << 9);

    return I2C_OK;
}

I2C_Status_t I2C_Master_Receive(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(I2C))
    {
        return I2C_ERROR;
    }

    // Master issues the Start
    I2C->CR1 |= (1 << 8);
    // hardware clears it after the start is sent

    // poll the SB bit 0 in SR1
    if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
    {
        return I2C_ERROR;
    }

    // clear the SB bit 0 in SR1 by readimg the SR1 and then writing the DR with the slave's address
    // SR1 read is consumed in the loop above, so the DR write completes a clear

    // write a peripheral address to the DR
    // since we want to read data bytes from the peripheral, we are setting the bit 0 (R) as 0x01 = 1
    I2C->DR = (slave_addr << 1) | (0x01 << 0);

    // poll the ADDR
    // hardware sets it to 1 after the ACK of the byte, so after the peripheral has acknowledged its address
    if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
    {
        return I2C_ERROR;
    }

    /* ----- ONE-BYTE SCENARIO ----- */
    if (length == 1)
    {
        // we have already polled ADDR

        // clear the ACK (Bit 10 CR1)
        I2C->CR1 &= ~(1 << 10);
    }
    /* ----- ONE-BYTE SCENARIO ----- */

    // read the SR1 and SR2 to clear the ADDR bit in the SR1
    // SR1 read is consumed in the ADDR polling loop, so SR2 read completes a clear
    uint32_t dummy = I2C->SR2;
    (void)dummy; // preventing the compiler warnings of an unused variable

    // ensure we are the Master (MSL, bit 0 = 1) and Receiver (TRA, bit 2 = 0)
    // 0b0001 = 2^0 = 1 = 0x01
    if ((I2C->SR2 & ((1 << 2) | (1 << 0))) != 0x01)
    {
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 |= (1 << 9);
        return I2C_ERROR;
    }

    /* ----- ONE-BYTE SCENARIO ----- */
    if (length == 1)
    {
        // set STOP condition
        I2C->CR1 |= (1 << 9);

        // wait for a byte from the peripheral (poll RxNE Bit 6)
        if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
        {
            return I2C_ERROR;
        }

        *data = I2C->DR;

        // enable ACK
        I2C->CR1 |= (1 << 10);

        // the first and simultaneously the last byte of data has been received, so exit the function
        return I2C_OK;
    }
    /* ----- ONE-BYTE SCENARIO ----- */

    for (uint8_t i = 0; i < length; i++)
    {
        // check if we are about to handle the second-to-last byte
        if (i == length - 2)
        {
            // if so, we need to clear ACK bit in CR1 to prevent the peripheral to send us unwanted bytes
            I2C->CR1 &= ~(1 << 10);
        }

        // wait for a byte from the peripheral (poll RxNE Bit 6)
        if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
        {
            return I2C_ERROR;
        }

        data[i] = I2C->DR;

        // check if we have handled the second-to-last byte
        if (i == length - 2)
        {
            // if so, the last byte is already clocking in, so we need to issue the STOP condition
            I2C->CR1 |= (1 << 9);
        }
    }

    // after the data was received and the STOP issue was issued, re-enble the ACK
    I2C->CR1 |= (1 << 10);

    return I2C_OK;
}

I2C_Status_t I2C_Master_Transmit_Receive(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *pSend, uint8_t *pReceive, uint8_t send_length, uint8_t receive_length)
{
    if (hi2c == NULL || pSend == NULL || pReceive == NULL || send_length == 0 || receive_length == 0)
    {
        return I2C_ERROR;
    }

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // wait until the bus is completely idle (BUSY == 0)
    if (I2C_PollHardwareBusy(I2C))
    {
        return I2C_ERROR;
    }

    // Master issues the Start condition
    I2C->CR1 |= (1 << 8);
    // the hardware clears this bit when the start is sent

    if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
    {
        return I2C_ERROR;
    }

    // clear the SB bit by reading the SR1 and writing the DR register
    // SR1 read was done in a polling loop above, so the next DR writing completes the clear

    /* ----- WRITE PART ----- */

    // write the slave's address (7 bits) + the bit 0 of 0 (Writing) (the Master sending bytes over line to the slave)
    I2C->DR = (slave_addr << 1) & ~(0x01 << 0);

    // poll the ADDR bit 1 in SR1
    // it is set by hardware when the peripheral acknowledges its address

    // to eliminate cases when there is firstly an error, and then the ADDR bit hits, so the polling loop exits without handling the error
    // check the error flags first and handle them, then check for the ADDR bit

    if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
    {
        return I2C_ERROR;
    }

    // clear the ADDR bit
    // SR1 read was done in the poll loop above, so only SR2 read remained to complete the clear
    uint32_t dummy = I2C->SR2;
    (void)dummy;

    // ensure we are the Master (MSL, bit 0 = 1) and Transmitter (TRA, bit 2 = 1)
    // 0b0101 = 2^2 + 2^0 = 4 + 1 = 5 = 0x05
    if ((dummy & ((1 << 2) | (1 << 0))) != 0x05)
    {
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 |= (1 << 9);
        return I2C_ERROR;
    }

    // send the data
    for (uint8_t i = 0; i < send_length; i++)
    {
        // poll the TxE Data register empty (transmitters)
        if (I2C_PollHardwareFlags(I2C, I2C_TXE_MASK))
        {
            return I2C_ERROR;
        }

        I2C->DR = pSend[i];
    }

